{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Maya&#39;s Daydreams",
	"language": "en",
	"home_page_url": "https://mayasdaydreams.com/",
	"feed_url": "https://mayasdaydreams.com/feed/feed.json",
	"description": "this is where i hang out on the internet",
	"author": {
		"name": "Maya",
		"url": "https://mayasdaydreams.com/about/"
	},
	"items": [
		{
			"id": "https://mayasdaydreams.com/blog/callinginsick/",
			"url": "https://mayasdaydreams.com/blog/callinginsick/",
			"title": "I called in sick to work today because of my period",
			"content_html": "<p>I callled in sick to my job today because of my period. I did attend a few meetings and handled a fraction of the avalanche of emails that are stressing me out, but for some reason I feel like it was dishonest to call in sick. I did not realize that my hormones would become such a reoccurring topic on my blog, but here we are with another period post.</p>\n<p>I did not sleep all night because I was uncomfortable (not in horrible pain, which I was happy to notice), I was dealing with mild cramps this morning. And today, because I trying not to cry my eyes out because my husband is leaving for a two and a half week trip to see his extended family in Europe. (Don't comment on my commas I'm trying to take advice from Ursula Le Guin). I also spent most of last night and today feeling like I was cleaning up a crime scene every hour. So I called in sick.</p>\n<p>I worked a little. Washed my pajamas (again), worked a little bit, watched Bridgerton, went for a walk (because my middle school gym teacher said it would help), picked up snacks on the way home, took a shower, and watched more Bridgerton. It feels like I took a day off and lied by using sick time. But I did feel sick. And I did the things that I knew would make me feel better just like if I had the flu.</p>\n<ul>\n<li>For the flu: i prescribe robitussin, lots of blankets, soup, and netflix</li>\n<li>For day 2 of your period: i prescribe trying to do something at your day job, calling in sick, making your cat be a hot water bottle, getting out your actual hot water bottle, sharing your hot water bottle. light exercise (gym teacher said so), snacks (i said so), and watching your favorite show. And also, deal with the debilitating pain, weird emotions, and constant gross feeling.</li>\n<li>For saying goodbye to your spouse for two and half weeks, I prescribe spending as much time with them as you can before they leave.</li>\n</ul>\n<p>Yeah, I called in sick today, and I really do feel like it was necessaey.</p>\n",
			"date_published": "2024-06-13T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/challenges/",
			"url": "https://mayasdaydreams.com/blog/challenges/",
			"title": "I love failing at challenges... getting ready for my next one",
			"content_html": "<p>It has been a minute since I last posted! In that time Weblog Posting Month left, June started, I went to Michigan for a funeral, did some online shopping, started a new decluttering challenge (I'm almost done!), and am getting ready to embark on my next one. I will now take a few minutes to reflect on all of these and talk a little bit about what's next. I also want to at some point make some updates to my website's design (if you can call it that, lol) this month. I won't really be mentioning that in the rest of this post, but that's my update!</p>\n<h2 id=\"weblog-posting-month-did-i-fail\" tabindex=\"-1\">Weblog Posting Month... Did I Fail? <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/challenges/\">#</a></h2>\n<p>I was tempted to call WeBlogPoMo a failure, but I won't do that to myself. I did not post every day. Which bummed me out. Basically as soon as I started to fizzle out and lose my motivation as a whole.</p>\n",
			"date_published": "2024-06-12T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday19/",
			"url": "https://mayasdaydreams.com/blog/pomoday19/",
			"title": "I am on a productivity soul-searching journey",
			"content_html": "<p>I am still slowly making my way through my Johnny.Decimal workbook. My mission was simple, organize my Notion using the numbering system so that I could find my databases easier. For a week, I was basically tracking my entire life with a huge kanban board for all of my work and life tasks, thoughts, and reminders. I tried not to categorize everything to start and just let everything mix together and exist in one big list.</p>\n<p>I quickly became overwhelmed. So I made a work and not-work section, and then I started filtering out things that I marked as finished just because it was starting to get confusing. My week of experimentation was over. All of my databases and dashboards were all stored in a page called “Everything else,” and I was ready to start to categorize my Notion. But then I started to doubt if Notion is really the right home for <strong>everything</strong>.</p>\n<p>For the time being, I dusted off my old Todoist account and migrated over my little collection of unfinished tasks and thoughts, and started to look at the rest of my digital world. There’s my personal computer, my work computer, my google drive, I have an administrative sharepoint folder at work as well, several different notes apps, and tons of physical notebooks that need to be archived. I realized that the scope of my project was way bigger than my Notion.</p>\n<p>I was hoping that at this point I would have a new iteration to show for my efforts. For now, all I have is this incomplete list of tools that I use:</p>\n<p>I also finally started reading David Allen’s Getting Things Done... This has quickly turned into a soul-searching effort. Productivity is not something that I like thinking about too much, but I am also trying to have a system that I can trust. I will continue to document my journey.</p>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and blog/weblogpomo2024/some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/blog/weblogpomo2024\">go here</a></p>\n<p>Post 19/31</p>\n",
			"date_published": "2024-05-25T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday18/",
			"url": "https://mayasdaydreams.com/blog/pomoday18/",
			"title": "these last two weeks were insane and i&#39;m still thinking about my run",
			"content_html": "<p>I can't believe it's been so long since I posted. Normally, I would say this is more like my target posting cadence, but I <em>did</em> sign up for a daily posting challenge this month. I am feeling a little bit bummed that I didn't totally make it to a full 30 days. Two weeks of consistent posting is something to be proud of, and things got pretty crazy. So, it's all good. I plan to try my best to finish the month out strong.</p>\n<p>Last week was getting my period back and preparing for a scary meeting. This week was my scary meeting. At the end of the last few days, I have prety much only had the energy to eat something and watch One Piece. I needed to take something off of my plate, and pausing on a writing challenge was the easy pick.</p>\n<p>This post is not to beat myself up, but I do think that my feelings about consistency are changing. I was thinking about this on my run last weekend because I used to be really hard on myself about my running consistency. I would basically tell myself that my inability to get in my short training runs and speed workouts on the weekdays meant that I didn't deserve to go on beautiful long runs on weekends. It's a silly way to think about it, but it really felt that way.</p>\n<p>I also used to spend my training blocks leading up to races doing the same thing. Afraid that I will get kicked off the course (it could still happen!) or whatever because I didn't follow my plan perfectly. I always find myself shocked when my race results come back and learnt that I finished solidly in the middleth place. I have done maybe 10? races since I started running and that has always been the case. If I look at my results objectively, I should be able to say that I am an average runner. I just feel slow because I am obsessed with Strava and I just seem unserious compared to my mutuals.</p>\n<p>It feels so silly to be so hard on myself and not let myself enjoy a day, make myself feel like I don't deserve to be there just to find out that I'm just like everyone else! I have been really enjoying reading other people's blogs and plenty of others have taken breaks this month or had to scale back the scope of their posts. It's okay to do things not perfectly.</p>\n<p>I am beginning to see the impact that perfectionism has had on my mental well being. I would classify myself as very high performing in my professional life, I set very high standards for myself. I am trying to relax a lot of bit in my worklife. But even in my leisure time, I still have this expectation for excellence that I really don't need.</p>\n<p>This is my 18th silly little post and at some point this week I will go on a silly little run. I got just as much out of writing this one post this week as I will with my run, and that's enough for me. If I do anything else, it's a bonus.</p>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and blog/weblogpomo2024/some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/blog/weblogpomo2024\">go here</a></p>\n<p>Post 18/31</p>\n",
			"date_published": "2024-05-23T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday17/",
			"url": "https://mayasdaydreams.com/blog/pomoday17/",
			"title": "running diary - lake chabot, ca",
			"content_html": "<p>Today I went for a run in lake chabot. It ended up being about 8.6 miles with 900 feet of elevation gain. The first half was very difficult, pretty much up hill the whole way. Maybe the last two or three miles went back to being flat. I had an amazing time, it has been two years since I did that run.</p>\n<img src=\"https://mayasdaydreams.com/img/lakechabot.png\" width=\"650px\">\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and blog/weblogpomo2024/some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/blog/weblogpomo2024\">go here</a></p>\n<p>Post 17/31</p>\n",
			"date_published": "2024-05-18T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday16/",
			"url": "https://mayasdaydreams.com/blog/pomoday16/",
			"title": "a week in review",
			"content_html": "<h3 id=\"what-a-week\" tabindex=\"-1\">What a Week <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday16/\">#</a></h3>\n<p>I had an intense week this week. Big presentation, big deadlines, big conversations, socialized this week, and I got my period for the first time in years. I was not prepared. I think I might have lost my therapist? I’m not sure, I’m confused. This was such a hard week, that I couldn’t really do anything about it. I missed my post for yesterday, and I’m okay with that. Something had to give.</p>\n<p>I think the combination of all of the above put me in a bit of a shopping relapse. Nothing too bad, but I feel a little sad. I mostly bought digital things, which is a little weird.</p>\n<h3 id=\"biggest-win\" tabindex=\"-1\">Biggest win <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday16/\">#</a></h3>\n<p>Stuck up for myself at work!</p>\n<h3 id=\"recent-favorites\" tabindex=\"-1\">Recent Favorites <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday16/\">#</a></h3>\n<p>I have been loving Shogun. I pretty much ripped through all of Bridgerton Season 3 Part 1 in one sitting. We are rewatching Better Call Saul as well.</p>\n<p>I haven’t been reading much outside of productivity books. I am on a bit of a life overhaul kick.</p>\n<h3 id=\"weekend-project-ideas\" tabindex=\"-1\">Weekend Project Ideas <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday16/\">#</a></h3>\n<p>I think I’m happy with the content (for now) on my front page. So, I think my next project will be to edit the blog front page a little bit. I want to organize my novel a little bit. I am also thinking about going for a little bit of a train run!</p>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and blog/weblogpomo2024/some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/blog/weblogpomo2024\">go here</a></p>\n<p>Post 16/31</p>\n",
			"date_published": "2024-05-17T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday15/",
			"url": "https://mayasdaydreams.com/blog/pomoday15/",
			"title": "having a body is weird!",
			"content_html": "<p><span style=\"color:red\"> <em>got my period back after 4 years</em></span></p>\n<p>thank u  for your service, mirena &lt;3</p>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and blog/weblogpomo2024/some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/blog/weblogpomo2024\">go here</a></p>\n<p>Post 15/31</p>\n",
			"date_published": "2024-05-15T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday14/",
			"url": "https://mayasdaydreams.com/blog/pomoday14/",
			"title": "johnny.decimal update",
			"content_html": "<p>My first week experimenting with the johnny.decimal system and following the steps in the workbook has been really interesting! I have been trying my best to refrain from categorizing my stickies and just let them all sit there, but halfway into my tuesday, i decided to just make an inbox section, a work section, and a not work section. anything that pops into my head, things i need to do, places i want to be able to find things, where i usually keep stuff, random thoughts. so far there are three different sticky notes about minotaurs...</p>\n<img src=\"https://mayasdaydreams.com/img/day14.png\" width=\"650px\">\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and blog/weblogpomo2024/some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/blog/weblogpomo2024\">go here</a></p>\n<p>Post 14/31</p>\n",
			"date_published": "2024-05-14T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday13/",
			"url": "https://mayasdaydreams.com/blog/pomoday13/",
			"title": "crochet project - neon coasters",
			"content_html": "<p>Long day, here are some coasters that I made over the weekend!</p>\n<img src=\"https://mayasdaydreams.com/img/coasters.png\" width=\"800px\">\n<p>Find the pattern (free!) <a href=\"https://www.ravelry.com/patterns/library/citrus-coaster\">here</a>.</p>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and blog/weblogpomo2024/some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/blog/weblogpomo2024\">go here</a></p>\n<p>Post 12/31</p>\n",
			"date_published": "2024-05-13T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday12/",
			"url": "https://mayasdaydreams.com/blog/pomoday12/",
			"title": "employing the johnny.decimal system into my notion life OS",
			"content_html": "<p>I know that I have been going on and on about how I have been trying to curb my impulse spending and following a stricter budget, and just generally learning to be more responsible with my money. Well, in a moment of weakness this week, I purchased Johnny.Decimal's <a href=\"https://johnnydecimal.com/10-19-concepts/14-build-your-system/14.02-the-decimal-workbook/\">workbook</a>. After a couple of days of beating myself up about it, and even bringing it up in therapy, and skimming through it a few times. I finally figured out where I can implement this and have it help me right away: My Notion. The thought of organizing my personal computer, work computer, or work email felt way too intimidating, but most of the important things from all three of these digital spaces end up as a note, or page, project, or task in my Notion.</p>\n<p>My Notion is a labrynth of databases that reference each other, or show up again and again in different views. Over the years, it has started to go so deep, that I struggle to remember where each database is originally located. So this is the project: use the <a href=\"https://johnnydecimal.com/\">Johnny.Decimal</a> System to organize my databases and pages. I have a feeling that this project will get messy, so I might as well document it!</p>\n<h2 id=\"what-is-notion\" tabindex=\"-1\">What is Notion <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday12/\">#</a></h2>\n<p>Adds creating a Notion information page to my digital garden to my to-do list...</p>\n<h2 id=\"what-i-use-notion-for\" tabindex=\"-1\">What I Use Notion For <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday12/\">#</a></h2>\n<p>Everything. Here's a little before pic:</p>\n<img src=\"https://mayasdaydreams.com/img/jd-before.png\" width=\"800px\">\n<h2 id=\"the-systems-that-i-have-tried\" tabindex=\"-1\">The Systems that I have Tried <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday12/\">#</a></h2>\n<p>PARA\nAugust Bradley's System\nA few others I found on YouTube\n(I'll come back and add links later)</p>\n<h2 id=\"where-johnny-decimal-fits-in\" tabindex=\"-1\">Where Johnny Decimal fits in <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday12/\">#</a></h2>\n<p>We shall see!</p>\n<h2 id=\"what-i-did-so-far-this-is-going-to-take-a-while\" tabindex=\"-1\">What I did so far (this is going to take a while) <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday12/\">#</a></h2>\n<p>I defined my scope and made a little &quot;sticky note&quot; page in my notion. I will use this for the next week</p>\n<h2 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday12/\">#</a></h2>\n<p>I'll be back</p>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and blog/weblogpomo2024/some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/blog/weblogpomo2024\">go here</a></p>\n<p>Post 12/31</p>\n",
			"date_published": "2024-05-12T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday11/",
			"url": "https://mayasdaydreams.com/blog/pomoday11/",
			"title": "website overhaul",
			"content_html": "<p>So, I decided to start over on my CSS stylesheet for my page... just to see what happens. I have learned so much in the last month, that I am trying to see how far I can get by hand-ish. Here's a little screencapture of how far I got today. I also added a changelog to the homepage!!</p>\n<img src=\"https://mayasdaydreams.com/img/5-11_redesign.png\" width=\"500\">\n<p>I also just realized that the link is broken to go to my <a href=\"https://mayasdaydreams.com/blog/weblogpomo2024\">original list of post ideas</a> on all of the posts before this. I'll go back and fix it on the rest of the posts after the month is over. I'm a little bit scared that all of my edits will be spammed to Mastodon. I have also been lazy about hyperlinking and referencing things thus far, so that's another retrospective change that I'll make at the end of the month.</p>\n<p>I am a big fan of the idea of digital gardens, and I would love to all of these posts and pages to be seen as living documents that eventually, you'll be able to click around at your leisure. In the meantime, I'm still trying to learn how websites work and finding my blogging style, so I hope you're all liking the chaos that has been coming from this page all this month.</p>\n<p>I hope you're all enjoying your saturdays!</p>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and blog/weblogpomo2024/some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/blog/weblogpomo2024\">go here</a></p>\n<p>Post 11/31</p>\n",
			"date_published": "2024-05-11T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday10/",
			"url": "https://mayasdaydreams.com/blog/pomoday10/",
			"title": "on seasonal hobbies",
			"content_html": "<p>I was beating myself up because I realized that I haven't been working on my crochet project as much lately. I felt like I was abandoninc a hobby that I have invested a lot of time, money, and storage space on. I felt really down about it until I started to think about how I have been filling my time instead, and realized that I have been making quite a bit of progress in my coloring books lately. Another activity that between the books themselves, and my colored pencil collection also takes up a ton of storage space. This got me thinking that maybe my hobbies are actually seasonal. It would make sense that being underneath a big wool blanket all day doesn't sound as appealing on a hot day as it would on a cold, rainy day. Similarly, sitting up at a table on a chilly day doesn't sound as nice as sitting in front of an open window and coloring and drinking water.</p>\n<p>Anyways, I think I learned something about myself today!</p>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/weblogpomo2024/\">go here</a></p>\n<p>Post 10/31</p>\n",
			"date_published": "2024-05-10T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday9/",
			"url": "https://mayasdaydreams.com/blog/pomoday9/",
			"title": "planning out the coming few months",
			"content_html": "<p>My therapist brought up an interesting mindset for me to try on for size, she called it the farmer vs. the hunter mindset. As I always do, I tried to see if there were any interesting YouTube videos that I could help me learn more about what she was talking about. Unfortunately the videos were either literally about farmers vs hunters, investing, farming simulators, or videos of vegans arguing with meat-eaters... not exactly what I was looking for.</p>\n<p>I guess from a mindset perspective, the names should be intuitive. Farmers are planting seeds and seeing the rewards of their small daily efforts after a longer time. Hunters are out seeking instant gratification, that one-off dopamine hit that will satisfy your current needs, but leave you wanting in a few days or even seconds in our tiktok-fueld world.</p>\n<p>We have been working together on helping me process issues that are keeping me in survival mode, when I don't need to be anymore. I have to learn to train myself to be more of a farmer when I have always been a hunter. I think that we are slowly chipping away at the things that I am working through, and I actually do feel like I am doing so much better!</p>\n<p>After my session, I went back through my list of daydreams from yesterday and started to map out when I thought I could maybe make those things happen in 10+ years, within 10 years, within 5 years, within 1 year, and within 6 months. Next I wrote down what I imagine that I will be doing 3 months from today, 2 months from today, 1 month from today, two weeks from today, one week from today, and tomorrow!</p>\n<p>It almost feels like I have a little action plan coming along...</p>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/weblogpomo2024/\">go here</a></p>\n<p>Post 9/31</p>\n",
			"date_published": "2024-05-09T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday8/",
			"url": "https://mayasdaydreams.com/blog/pomoday8/",
			"title": "what are my daydreams - new moon wishes",
			"content_html": "<p>This website is called maya's daydreams, but what are my daydreams? there are so many things! in honor of the new moon, let's make some wishes. At least the ones I feel comfortable sharing online!</p>\n<p>I would love to finish my first novel. My great monster romance...</p>\n<p>I want to start a youtube channel. I have actually been recording little faceless day in the life footage on my phone for a few weeks now. all i need to do is collect enough footage... and then write a script.</p>\n<p>I want to live more minimally and frugally. I want it to be second nature to have less and live with less.</p>\n<p>I want to get as close to a zero waste lifestyle as I possibly can</p>\n<p>I want to get out of student loan debt</p>\n<p>I want to run a marathon</p>\n<p>I want to run in the Boston Marathon</p>\n<p>I want to retire some day</p>\n<p>I want a dog</p>\n<p>I want to get a month ahead on my family's living expenses</p>\n<p>I want a side hustle that I enjoy</p>\n<p>I want to lose weight... just a little bit of weight</p>\n<p>I want to learn to love cooking</p>\n<p>I want to FINALLY pass the FE exam</p>\n<p>I want to sew a garment that I can wear on a daily basis</p>\n<p>I want to knit a sweater</p>\n<p>I want to knit a pair of socks</p>\n<p>I want a promotion</p>\n<p>I want to travel somewhere every year</p>\n<p>I want to hike the Appalachian Trail</p>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/weblogpomo2024/\">go here</a></p>\n<p>Post 8/31</p>\n",
			"date_published": "2024-05-08T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday7/",
			"url": "https://mayasdaydreams.com/blog/pomoday7/",
			"title": "i managed to add an image to my blog posts",
			"content_html": "<p>I am embarassed by how long this took me</p>\n<img src=\"https://mayasdaydreams.com/img/apollo1.jpeg\" width=\"500\">\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/weblogpomo2024/\">go here</a></p>\n<p>Post 7/31</p>\n",
			"date_published": "2024-05-07T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday6/",
			"url": "https://mayasdaydreams.com/blog/pomoday6/",
			"title": "Marry Me Chicken and Job Applications",
			"content_html": "<p>Another short post today. I have been home alone all weekend and my husband came home from visiting his sister today! I spent a big chunk of my planned writing time making a dish called Marry Me Chicken. It turned out really good, I can't really tell you anything about any wedding results. I also found a job opening that I need to apply for tonight. So excuse my short post today. I hope you all had a nice Monday!</p>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/weblogpomo2024/\">go here</a></p>\n<p>Post 6/31</p>\n",
			"date_published": "2024-05-06T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday5/",
			"url": "https://mayasdaydreams.com/blog/pomoday5/",
			"title": "My website is one month old!",
			"content_html": "<p>Here is the to-do list that i set up in this blog... once I figured out how to post... Let's revist my list... which I am realizing that I totally coded in a weird way... and let's also make a new list</p>\n  <h4>Website To-Do List</h4>\n  <p> <s> ❑ Figure out how to edit stylesheet </s> <em> completed 4/13/24 </em> </p>\n  <p> <s> ❑ Grid on homepage? </s> <em> completed 4/13/24 </em> </p>\n  <p> <s> ❑ Figure out how to edit the home page (lol) </s> <em> completed 4/13/24 </em> </p>\n  <p> <s> ❑ Figure out how to add pages </s><em> completed 4/13/24 </em>  </p>\n  <p> <s> ❑ Add a now page </s> <em> completed 4/13/24 </em> </p>\n  <p> ❑ Turn this list into a page / add changelog <em> have not started! </em>  </p>\n  <p> ❑ Figure out how to set up webmentions <em> still working on </em>  </p>\n  <p> ❑ Start planting digital garden seeds <em> started, but this will never be done </em>  </p>\n  <p> ❑ Link to neocities <a href=\"https://da-greenhouse.neocities.org/\">greenhouse </a></p>\n  <p> ❑ Join a webring? <em> done </em>  </p>\n<p>Looking back, I am honestly impressed with how far I got! There was quite the learning curve with learning how to launch a static website, but I feel really accomplished! Even if my page is kind of clunky... Here's an  updated to-do list for future me to work on. I am mainly focusing on posting month this month, but these are the ones that have been bugging me while i click around...</p>\n<h4 id=\"website-to-do-list\" tabindex=\"-1\">Website To Do List <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday5/\">#</a></h4>\n<ul>\n<li>Add a changelog</li>\n<li>Figure out webmentions</li>\n<li>neocities page build-out</li>\n<li>find a new heading font for my website</li>\n<li>figure out how to add images to blog posts</li>\n<li>update the general fonts on my website</li>\n<li>more shrines!</li>\n<li>add a resources page (with a free notion template, my other love!)</li>\n</ul>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/weblogpomo2024/\">go here</a></p>\n<p>Post 5/31</p>\n",
			"date_published": "2024-05-05T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday4/",
			"url": "https://mayasdaydreams.com/blog/pomoday4/",
			"title": "Four Months Into My No-Buy Year",
			"content_html": "<p><em>I still have not figured out why images aren't working in my blog posts, once I do, I will go back and include images from my trackers because I feel like they're mildly interesting! I am not a web developer, and I'm learning as I'm going on this website...</em></p>\n<p>I like having goals. I have been doing a no-buy / low-buy all year, and if I was going by my stated goal at the beginning of the year to &quot;buy nothing for myself for an entire year,&quot; and then to &quot;buy a reasonable amount with these rules&quot; when I realized that that wasn't possible. To failing at both for a time, to maybe having one bad day a week, to then having one bad weekend a month. I would say that I failed.</p>\n<h2 id=\"january\" tabindex=\"-1\">January <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday4/\">#</a></h2>\n<p>In January I started tracking my no spend with a very simple &quot;No Spend&quot; check box for every day of the month. For the first few days, it was easy to not spend money because I was home and tired of getting things from the holidays. It was so easy that I decided to not track at all. Until I got a $2.50 coffee at the courthouse while I was a jury duty... and then it just opened the flood gates. I didn't want to go back and fill in those days in my tracker because I felt so ashamed.</p>\n<p>I figured that maybe having one box to check was too much pressure. My perfectionist tendencies were getting in my way. At the end of January, I started tracking my spending by category rather than just having one big No Spend box that I could fill in every day. Historically, my areas have been clothes, craft supplies, books, and eating out, so I went with those. Making this change was super helpful for me, and I felt like I had a little bit more information to help me strategise a little bit better.</p>\n<h2 id=\"february\" tabindex=\"-1\">February <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday4/\">#</a></h2>\n<p>This new system made February feel so much easier. I bought one clothing item, got craft supplies once (after finishing a project). I let myself get lunch/food out by myself once per week and stuck to it. I said I could go to a coffee shop twice in the month, but I HAD to sit down and be in the coffee shop and make it an experience. That all went great! But there were still purchases I was making that didn't fit into these categories, so I added a &quot;questionable&quot; category. Those little questionable dots started to increase in frequency as the month went on... A lot of them were wordpress related if I remember correctly, so I'm glad to have finally moved on!</p>\n<h2 id=\"march\" tabindex=\"-1\">March <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday4/\">#</a></h2>\n<p>I feel very dumb for not backing up my old blog posts from the wordpress days, because I chronicled my struggles through all of this past March. March was the month that I felt like completely giving up, I felt like I was back to my old spending habits, and that I should just accept that this is the way I am. The big killer in March was books and I felt so bad that I didn't even both tracking them. I was also making lots of questionable purchases, and I was back to binge eating again. :(</p>\n<p>Looking back through my spending history though, I was still miles away from my spending behaviors in November and December of last year, and breaking bad habits takes time. I also noticed that my craft supplies purchases were zero!!! So I don't see March as a total loss!</p>\n<h2 id=\"april\" tabindex=\"-1\">April <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday4/\">#</a></h2>\n<p>I decided to keep trying, I started April with slightly different rules, things like I can buy a book, but I have to finish one first. The first week of April was full of questionable puchases, two books, and I ate out a lot! But that number started to dwindle quite a bit, to my surprise, gradually and kind of naturally. It helped that I figured out some ways to get books for free and started decluttering more. I also got a little bit deeper into my EMDR therapy, where we have been working through my relationship with money and stuff. More on that later...</p>\n<h2 id=\"looking-ahead-to-may\" tabindex=\"-1\">Looking ahead to May! <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/pomoday4/\">#</a></h2>\n<p>My tracker is very different this month. I took clothes off my list because I realized that they weren't a problem at all... and I added alcohol as a new habit that I want to kick. It's just been starting to make me feel sicker than I used to. I also took off craft supplies. Decluttering and downsizing has me realizing that I really need to finish the projects in my basket before starting anything new. I have also started this new YNAB system, so at the moment, I don't really have money allocated to buying things or eating out, because I have some more concrete goals that I'm working towards. I am VERY curious to see how this month goes after April went so well!</p>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/weblogpomo2024/\">go here</a></p>\n<p>Post 4/31</p>\n",
			"date_published": "2024-05-04T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday3/",
			"url": "https://mayasdaydreams.com/blog/pomoday3/",
			"title": "A Dumbass Tries to Learn to Budget",
			"content_html": "<p>Today's fixation is the You Need a Budget (YNAB) system. I have been working very hard to simplify my life lately. Saying that feels like an oxymoron, but it's true! It really is work when you're actually &quot;working on yourself.&quot; One thing that I have been starting to realize is that when I avoid things because they stress me out, they still are stressing me out. Out of sight, out of mind doesn't really work for me. Does it work for anyone? I have been trying several platforms over the last few months to track my spending and set a budget.\nGoogle Sheets and Excel were great for tracking and making pretty charts... but manually inputting every thing thing I spent money on stressed me out, and I felt guilty for everything, even if it was &quot;in the budget.&quot; Everything always went over, or something came up that I couldn't anticipate and threw the whole thing off...</p>\n<p>I also tried out budgeting in Notion for a while, and I actually might keep including it in my little daily / weekly tracking database, just to see how my spending behaviors and how all the other things going on in my life may or may not be related. Like, &quot;oh that week where I took on way too much at work was the one where I bought lunch out a lot!&quot; or &quot;I always seem to buy courses at the start of a new month because I'm going to change my life and reinvent myself!&quot;</p>\n<p>I tried tracking my spending in my planner and keeping an analog category tracker. This one has actually stuck for the last few months, but it mainly serves as a visual queue and I don't need to be buying anymore books this month, or that maybe I should FINISH a crochet project before ordering a bunch of yarn for a new one. I can't really plan ahead with it.</p>\n<p>Next, I tried Rocket Money. This was definitely an upgrade from Notion just for the fact alone that my transactions were automated. I also like the visuals of how much I spent from month to month as a benchmark if I'm making progress in reducing spending. It's also nice having the reminders about subscriptions. I have cancelled SO many of them since starting to use this app... But I still felt like I can't really plan ahead / see a way out of my particular cycles that I don't want to get into here, but I needed help prioritizing I guess?</p>\n<p>This was how I came around to YNAB... It's been less than a week so maybe I'll come back with an update post on this topic if it stuck, but I feel like I found a nice balance with seeing what my expenses are, what I think I want to spend on the unpredicatables of life, and how much I want at certain points in the future for different things. I can go in more detail in the update post as I document my experience a little bit more, but for some reason planning based on the money you have instead of what you are going to make throughout the month is really helping me with those short-term decisions and seeing how they impact long-term ones. Once again, these were lightly edited, semi-stream of consciousness morning pages thoughts, so I am not 100% sure if they fully made sense.</p>\n<p>See you tomorrow!</p>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/weblogpomo2024/\">go here</a></p>\n<p>Post 3/31</p>\n",
			"date_published": "2024-05-03T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/pomoday2/",
			"url": "https://mayasdaydreams.com/blog/pomoday2/",
			"title": "A Peek Into My Morning Pages",
			"content_html": "<p>This month I am cheating a little bit on my morning pages. I try to write 500 words every morning in StimuWrite every morning, just to get the juices flowing. I am not consistent at it at all. I blame the fact that I have been really struggling to wake up early every day.</p>\n<p>I am using my little 500 words goal that I have carved out to write blog posts this month... if any one was wondering why I included that in my personal list of parameters for this month. That is my optional rule that is meant to stretch me a little bit. Plus just get me in the habit of sitting down to write /something/.</p>\n<p>Similarly to my dream of running the Big Sur Marathon, I also really, really want to write a fantasy novel. I actually have most of the plot written out, it's been sitting in my documents folder for about 9 months now without any updates from me. I always have an excuse about why I can't work on it, I need to study for my FE exam, I'm tired, I decided to run instead (lol), I could list a million and one reasons. I honestly kind of hate advice that you need to do things every day to be serious about them. The irony of choosing to do this daily challenege is not lost on me.</p>\n<p>I actually did something  similar with the last iteration of this blog when I was still using wordpress / bluehost (derrogatory) for hosting. I did manage to make a post every day, except for maybe one or two days. So I know that this is isn't that much of a stretch for me. I have always treated my blog as an outlet for me to store half-baked ideas, and think out loud to people. But consistency in other things? Not so much luck.</p>\n<p>The time that I stopped working on my writing project and when I stopped doing morning pages coincided. In fact, the novel idea was born out of an entry just like this one. Albeit, I was doing handwritten morning pages then... and also not posting them publically. Julia Cameron would probably be very disappointed in me if she happened to find my blog (I love your work if you're here!). I am trying to work with myself and where I'm at in life.</p>\n<p>Right now I am prioritising sleep and healing from burnout. I am trying not to add too much to my plate while also trying to stay somewhat consistent in my hobbies. I am also mentally preparing for a big move and downsizing our apartment. Along with running in a race last weekend, we also drove to a completely different part of California to look at houses. We ended up finding a place, it's very cute. We will need to downsize by over 200 sq ft, so decluttering is also taking up quite a bit of time. I am also enjoying running and crocheting, and blogging. Where does novel writing fit in? At the moment, I don't know, but maybe we can figure it out together!</p>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/weblogpomo2024/\">go here</a></p>\n<p>Post 2/31</p>\n",
			"date_published": "2024-05-02T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/bigsur2024/",
			"url": "https://mayasdaydreams.com/blog/bigsur2024/",
			"title": "A Love Letter to the Big Sur Marathon",
			"content_html": "<p><img src=\"https://mayasdaydreams.com/Users/mayaprice/Documents/Projects/mayas-daydreams/content/blog/bigsur2024/pic1.jpeg\" alt=\"excuse the broken image, i seem to not know how to post images in my blog posts yet, will add soon! In the meantime, picture a big little lies cut scene\"></p>\n<p>Running is one of my great loves. I'm not very good at it, and it's taken me a long time to be okay with that. I think that one of the big journeys that I have been on since turning 30 is learning to enjoy things in spite of being bad at most of my hobbies. I am not sure exactly where this idea came from, but it always felt like things weren't worth doing if I couldn't do it perfectly. Yes, I am a recovering perfectionist. Last weekend I participated in the Big Sur Marathon... not the full marathon... the 12k.</p>\n<p>I have been dreaming of doing the <em>actual</em> for many, many years. It's still a dream!! I even signed up for the full marathon twice and injured myself... twice. Both of those failures really crushed me. My relationship with running and myself were in a dark place for a while. All of the miles, hours of running, and running essays I read were worth nothing because I didn't make it to the start line.</p>\n<p>The Big Sur Marathon is... special. It's really not a good choice for people who are looking to run their first marathon. Although this year was not the usual course because a portion of Highway 1 washed out in a storm. It is also either one of the, or THE hilliest marathon in the country. Those heights pay off though because you're running along one of the most iconic roadways in the world. And because it's on Highway 1, which means they need to close the highway for race day means that there's a pretty strict time limit of 6 hours. There's something about the combination of the scenery, the physical challenge, and that ever present threat that the highway will one day completely fall into the ocean makes me really want to experience the full 26.2 mile distance on foot.</p>\n<p>Now that I know where I'm at with my running better now, I think that I could maybe make it to 6 hours on a perfectly flat course. Realizing I was going to fail this race not once, but twice really felt like I died trying. To my credit, I recovered and kept running, I set more realistic goals, and am keeping the marathon on my bucket list. I actually ran my first half marathon in March! So I would say that I'm well on my way to making it to the start line again. I had the time of my life this weekend running along the highway for a bit and then through Point Lobos Reserve was a dream. Gorgeous. I went into Sunday just wanting to have a good time.</p>\n<p>I'm a little bit weirdly obsessed with this race, but it turns out that I'm not alone in that. I feel like I got a taste of the experience that I was craving. The only sounds at one point were my footsteps and the waves hitting the rocks down below. It was beautiful and I felt strong. I had a plan for when I would eat my little snack, I knew exactly when I wanted to take a walking break. Much to my amazing luck that was also the point where the big 12k photo op was, so my pictures make it look like I just went on a nice seaside stroll, looking for mermaids.</p>\n<hr>\n<p>All of May 2024, I will be participating in weblog posting month created by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Annie Greens</a></p>\n<p>For a list of other participants, <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024/participators\">go here</a></p>\n<p>For a list of my topic ideas and some rules I wrote for myself, <a href=\"https://mayasdaydreams.com/weblogpomo2024/\">go here</a></p>\n<p>Post 1/31</p>\n",
			"date_published": "2024-05-01T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/weblogpomo2024/",
			"url": "https://mayasdaydreams.com/blog/weblogpomo2024/",
			"title": "It&#39;s Weblog Posting Month! + 31 Blog Post Ideas",
			"content_html": "<p>I recently set up my <a href=\"https://mastodon.social/@mayasdaydreams\">Mastodon</a> profile. I am dubious about it, but I did come across this hashtag: <a href=\"https://mastodon.social/tags/weblogpomo2024\">#weblogpomo2024</a>. Despite my better judgement, I want to go for it.</p>\n<h2 id=\"what-is-weblogpomo\" tabindex=\"-1\">What is WeblogPoMo? <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/weblogpomo2024/\">#</a></h2>\n<p>Started by <a href=\"https://weblog.anniegreens.lol/weblog-posting-month-2024\">Apple Annie</a>, Weblog Posting Month (#WeblogPoMo2024) is a one-month blogging challenge to post daily between May 1st, 2024 and May 31st, 2024. Anyone with a personal blog should participate!</p>\n<h3 id=\"da-rules-my-rules\" tabindex=\"-1\">Da Rules (my rules) <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/weblogpomo2024/\">#</a></h3>\n<p>Here are the rules that I have set for myself</p>\n<ul>\n<li>Post every day</li>\n<li>I am allowed to batch write posts ahead of time (I know myself, and I want to set myself up for success 😇)</li>\n<li>500 Word Minimum (arbitrarily) per post</li>\n<li>Interact with at least one other blog each day!</li>\n<li>Have fun and be creative 😚</li>\n</ul>\n<h3 id=\"31-topic-ideas-some-of-these-are-very-specific-but-feel-free-to-borrow-from-this-list\" tabindex=\"-1\">31 Topic Ideas (some of these are very specific, but feel free to borrow from this list) <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/weblogpomo2024/\">#</a></h3>\n<ol>\n<li>Blogging and why I like blogging</li>\n<li>My most recent trip</li>\n<li>More thoughts on decluttering</li>\n<li>A rant about how my insurance seems to really want to keep me out of therapy</li>\n<li>Anxieties about moving</li>\n<li>Book review(s)</li>\n<li>Recipes</li>\n<li>Fan girl about notion</li>\n<li>Write about the process of building the shrine section of my web page</li>\n<li>Document building my mermaid shrine</li>\n<li>Taylor swift album review (at some point I want to go through all of them!)</li>\n<li>Weekly general life updates</li>\n<li>A collection of interesting links</li>\n<li>An updated list of things I want to do to improve my blog</li>\n<li>Reflect on my first month on the indie web</li>\n<li>Write a post about my cat (link to his shrine, does he have a shrine yet)</li>\n<li>Write a post about Porter (RIP)</li>\n<li>Thoughts on no-buys and low-buys</li>\n<li>Publish more digital garden content (and be a little less of a perfectionist about it)</li>\n<li>A post about my relationship with perfectionism</li>\n<li>Mermaid shrine post</li>\n<li>MerMay art!</li>\n<li>Upload a page from my physical journal</li>\n<li>A post about my trip to the UK</li>\n<li>An update on my Japanese-learning journey</li>\n<li>Upload a notion template for folks 💖</li>\n<li>How has trying to embrace slow / simple living been going for me?</li>\n<li>What are some other things that I have been fixated on in the past?</li>\n<li>How are my 30s going so far?</li>\n<li>What have I learned about personal finance?</li>\n<li>I can’t believe I haven’t come to the end of this list without a post climate change-specific idea… so this is that post idea 🌏</li>\n</ol>\n<h2 id=\"it-s-also-mermay\" tabindex=\"-1\">It’s also MerMay <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/weblogpomo2024/\">#</a></h2>\n<p>It’s also MerMay which is an art challenge (think inktober) where you draw a mermaid theme piece of art every day. I don’t think that’s necessarily sustainable for me, but I’d love to mix some mermaid themed things that I have been working on throughout the month… maybe even get myself motivated to finally start working on my novel again!</p>\n<h3 id=\"why-am-i-doing-this\" tabindex=\"-1\">Why Am I Doing This? <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/weblogpomo2024/\">#</a></h3>\n<p>I have been blogging on this page for about a month now, and I feel like the main thing I am missing is community. This seems like the perfect way to interact with other bloggers a little bit more! Also it was the motivation I needed to finally set up an RSS feed (easier than I thought it would be!!)!</p>\n<h2 id=\"pomo-post-mortem\" tabindex=\"-1\">PoMo Post Mortem <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/weblogpomo2024/\">#</a></h2>\n<p>2024 WeblogPoMo Final Post List</p>\n<ol>\n<li><a href=\"https://mayasdaydreams.com/blog/bigsur2024/\">A Love Letter to the Big Sur Marathon</a></li>\n<li><a href=\"https://mayasdaydreams.com/blog/pomoday2/\">A Peek Into My Morning Pages</a></li>\n<li><a href=\"https://mayasdaydreams.com/blog/pomoday3/\">A Dumbass Tries to Learn to Budget</a></li>\n<li><a href=\"https://mayasdaydreams.com/blog/pomoday4/\">Four Months Into My No-Buy Year</a></li>\n<li><a href=\"https://mayasdaydreams.com/blog/pomoday5/\">My website is one month old!</a></li>\n<li><a href=\"https://mayasdaydreams.com/blog/pomoday6/\">My website is one month old!</a></li>\n<li><a href=\"https://mayasdaydreams.com/blog/pomoday7\">i managed to add an image to my blog posts, but...</a></li>\n</ol>\n",
			"date_published": "2024-04-30T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/been-a-weird-week/",
			"url": "https://mayasdaydreams.com/blog/been-a-weird-week/",
			"title": "It&#39;s Been a Weird Week",
			"content_html": "<p>Happy belated Earth Day! It has been a weird week for me, and I feel like since that last time I sat down to do an update a lot of things in my life have already changed again. There are just some periods in life where things move fast I guess.</p>\n<h2 id=\"personal-updates\" tabindex=\"-1\">Personal updates <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/been-a-weird-week/\">#</a></h2>\n<p>One strange thing about being in the climate field that I still haven't quite gotten a grip on, is that Earth Day, Earth Week, and Earth Month are VERY busy. It's nice to take a beat to celebrate the planet with folks, but the rest of the work doesn't stop in the meantime! On top of that, I also found out that I basically need to start looking for a new job... which is depressing, but I'm working through it...</p>\n<p>I have been pouring more and more time into this page, making tiny tweaks, adding little pages that I haven't created links for yet... There may or may not be a chance to explore a certain shrine that I started in the music section of this post...</p>\n<p>The only other thing that has been taking up quite a bit of my time <a href=\"https://mayasdaydreams.com/blog/I-need-to-declutter/\">decluttering</a> and unpacking (pun not intended) my relationship with <a href=\"https://mayasdaydreams.com/digital-garden/minimalism/\">minimalism</a>. I have since done some trips to donation centers and little libraries, but I have also been going through my external harddrive. I have taken thousands of photos over the last few years, and these have also been some of the most transformative times of my life. I let go of a lot of photos, which surprised me. A lot of it was junk, photos of receipts or homework, screenshots of stupid tweets or painful conversations. Random stuff like that. But I also ended up going through pictures from trips and letting some of those go too. I am maybe halfway through everything, but I want to do a deeper dive and maybe host some pictures from my favorite trips here, so I'll come back to this. But going through these decluttering exercises have been really eye opening and cathartic. It feels like a tiny dose of healing, in a weird way. I promise I'll start blogging about more things than minimalism and decluttering soon, this is just the season of life that I'm in at the moment.</p>\n<h2 id=\"reading-enchantment-by-katherine-may\" tabindex=\"-1\">Reading: Enchantment by Katherine May <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/been-a-weird-week/\">#</a></h2>\n<p>This little book is full of so many little gems of wisdon and her writing inspires me to become a better writer. In honor of tonight's full moon, I will leave a snippet of a passage that I wrote down in my commonplace book:</p>\n<blockquote>\n<p>As a child, I would look out of the window on a nighttime drive and think the moon was following us. From my vantage point, she seemed to be chasing us along the sky, breathlessly trying to keep up. Later I learned that it was just because she was so big that it felt like she was everywhere, and that I was small with an outsize sense of my own importance. Still, I was left with the impression that the moon had a certain constancy. It seemed that she was attentive to my needs, concernedly checking in. Sometimes I felt like I needed her gaze.</p>\n</blockquote>\n<h2 id=\"listening-the-tortured-poets-department\" tabindex=\"-1\">Listening: The Tortured Poets Department <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/been-a-weird-week/\">#</a></h2>\n<p>Oh boy, I am still unpacking this one. Taylor Swift album release nights have become a ritual for me at this point. And I even decided to start building my first <a href=\"https://mayasdaydreams.com/shrines/taylorswift/\">shrine</a> for this site in the hours that I was waiting. It's definitely a work in progress, but I had so much fun learning more about css to make my own little swiftie corner of the internet.</p>\n<h2 id=\"goals-from-the-beginning-of-the-month\" tabindex=\"-1\">Goals from the beginning of the month <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/been-a-weird-week/\">#</a></h2>\n<p>In my <a href=\"https://mayasdaydreams.com/blog/april-so-far24/\">first post</a>, I made a list of goals. I thought it might be fun to revisit these before setting some new goals.</p>\n<ul>\n<li>Soak up that eclipse energy <em>I did indeed, and I made some new moon wishes too</em></li>\n<li>Spend less money <em>I did indeed, I paid down some debt and owed on my taxes this year, so it doesn't feel like it... we also booked some travel so we made some big purchases too. But the general random spending on crap habit that I have been trying to kick is improving!</em></li>\n<li>Learn the numbers in Japanese <em>We're getting there, I haven't been practicing as much as I'd like to with how nuts it has been. I have been watching lots of anime lol</em></li>\n<li>Have a better week at work <em>about that...</em></li>\n<li>Do a new moon wishing ritual, and continue to follow the lunar cycle <em>forgot that i made a separate goal for new moon wishes along with enjoying the eclipse! but check! done! had a lovely time!</em></li>\n</ul>\n<h2 id=\"goals-for-the-rest-of-the-month\" tabindex=\"-1\">Goals for the rest of the month <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/been-a-weird-week/\">#</a></h2>\n<ul>\n<li>Full moon ritual! The fact that I am coming back on the full moon to do a life update is 100% coincidental</li>\n<li>Apply for 5 jobs</li>\n<li>Learn those stinkin Japanese numbers</li>\n<li>Start going to the gym again</li>\n<li>Finish reading a book</li>\n</ul>\n",
			"date_published": "2024-04-23T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/digital-garden/minimalism/",
			"url": "https://mayasdaydreams.com/digital-garden/minimalism/",
			"title": "My thoughts on minimalism",
			"content_html": "<p>When I talk about minimalism, I am talking about the lifestyle, rather than the aesthetic. To me, it's a practice of owning only what is essential to you, and letting go of the rest. I also think that while related, minimalism and conscious consumerism are two different things.</p>\n",
			"date_published": "2024-04-14T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/life-without-algoritms/",
			"url": "https://mayasdaydreams.com/blog/life-without-algoritms/",
			"title": "An Observation About Browsing Without The Algorithm",
			"content_html": "<p>I have been off of social media for a few months now. My accounts aren't completely gone, but I just don't visit the sites anymore. There was a time that having a presence on social media bothered me, but now it's just the incessant urge to scroll and keep up with what everyone I have ever had any brief interaction with (including if I just decided to follow them after bingeing Bridgerton). Simply logging off has relieved me of those awful feelings, and I didn't have to do anything that extreme (to me!!!).</p>\n<p>Even if I have been off of social media, I still wanted to be able to enjoy the internet, and casually browse. That bumbling around trying to find a new home on the internet landed me here, for which I am very grateful. I almost forgot what it was like to organically find cool websites, or interesting people's work to admire. I feel like in a way I found a way to enjoy the internet again without algorithms (or at least minimally!).</p>\n<p>One interesting observation I have made is that I spend more time thinking about whether or not I can trust the people behind the pages I find. Everyone I have come across seems to align in value with me, maybe that's just an aspect of the indie web, but I do have that moment of pause where I feel like I need to make sure. My hunch is that it's a reflex against being spoonfed content that is tailored to me, and suddenly being open to anyone's opinions. It's a nice feeling, just an observation...</p>\n",
			"date_published": "2024-04-14T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/recent-faves/",
			"url": "https://mayasdaydreams.com/blog/recent-faves/",
			"title": "Recent Faves",
			"content_html": "<iframe width=\"500\" height=\"315\" src=\"https://www.youtube.com/embed/4TffiAO-E_4?si=mTffkunRwOzb9gS0\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"></iframe>",
			"date_published": "2024-04-13T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/website-to-dos/",
			"url": "https://mayasdaydreams.com/blog/website-to-dos/",
			"title": "Website To Dos",
			"content_html": "  <h4>Website To-Do List</h4>\n  <p> <s> ❑ Figure out how to edit stylesheet </s> <em> completed 4/13/24 </em> </p>\n  <p> <s> ❑ Grid on homepage? </s> <em> completed 4/13/24 </em> </p>\n  <p> <s> ❑ Figure out how to edit the home page (lol) </s> <em> completed 4/13/24 </em> </p>\n  <p> <s> ❑ Figure out how to add pages </s><em> completed 4/13/24 </em>  </p>\n  <p> <s> ❑ Add a now page </s> <em> completed 4/13/24 </em> </p>\n  <p> ❑ Turn this list into a page / add changelog </p>\n  <p> ❑ Figure out how to set up webmentions </p>\n  <p> ❑ Start planting digital garden seeds</p>\n  <p> ❑ Link to neocities <a href=\"https://da-greenhouse.neocities.org/\">greenhouse </a></p>\n  <p> ❑ Join a webring?</p>\n",
			"date_published": "2024-04-12T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/I-need-to-declutter/",
			"url": "https://mayasdaydreams.com/blog/I-need-to-declutter/",
			"title": "I need to declutter.",
			"content_html": "<p>Last week we found out that we are moving this fall! I am super excited and nervous about it. Wondering if I can keep my job, what kind of place are we going to live in, am I going to like it, will the cat be happy? I think it will go great, plus we'll be a lot closer to the Sierras! But one thing that's been nagging me for a long time is the fact that I (and we) just have way too much crap.</p>\n<p>I definitely went on a retail therapy binge during the darkest times of the pandemic, and it took me a year or so after the worst of it had passed to realize that I didn't shake the habit. I am now faced with the daunting task of either packing and moving a bunch of stuff that I'm not sure if I even want/need anymore, or just getting rid of it.</p>\n<p>I have been curious about the idea of <a href=\"https://mayasdaydreams.com/digital-garden/minimalism/\">minimalism</a> for many years, but for whatever reason I haven't been able to commit to that lifestyle.</p>\n<p>I was talking about the anxiety that the mess in my office has been giving me during therapy, and we decided on an action plan. I committed to just trying to spend 15 - 20 minutes a day decluttering. I am hoping that we'll be more or less ready to move by August. I was curious how much total time would I spend decluttering between now and August 1st, and it came out to 28 hours.</p>\n<h3 id=\"28-hours\" tabindex=\"-1\">28 hours. <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/I-need-to-declutter/\">#</a></h3>\n<p>If I needed one reason to distance myself from stuff, it's that. That doesn't even count the trips to donation and reuse centers, or trying to sell or give things away on Facebook, or on those odd days where I feel like decluttering for longer! This also doesn't count the time it takes to just clean our apartment in general... Is this really how I want to spend my precious time?</p>\n",
			"date_published": "2024-04-12T00:00:00Z"
		}
		,
		{
			"id": "https://mayasdaydreams.com/blog/april-so-far24/",
			"url": "https://mayasdaydreams.com/blog/april-so-far24/",
			"title": "April So Far",
			"content_html": "<p>One week into April and I feel so much better than I did in March. Is March hard for other people, or am I just jinxing myself every year into having a bad month. Nevertheless, here's a little recap of my first week of April</p>\n<h2 id=\"personal-updates\" tabindex=\"-1\">Personal updates <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/april-so-far24/\">#</a></h2>\n<p>Work was super intense this week. By the end of the week I felt that good-old freeze response kick in as the sound of Teams chats and emails made me want to cry. It started with preparing for a stressful meeting where I proposed a project to my boss, then a public meeting that went a little sideways, too much work that I can fit into 8 hours, and a couple of passive aggressive emails from a coworker (as expected).</p>\n<p>This was also a week of great news too! My husband got into grad school!! Which we have been anxiously waiting to hear back about since last December. I am very proud of him and excited for our move. Thankfully we aren't moving far, and I should be able to keep my job! We both started to feel a little bit of anxiety now that reality is setting in and we've got to start planning for a pretty big life change.</p>\n<p>I also started learning Japanese this week! I feel like I already have a good amount of the hiragana alphabet down, and I was able to recognize a few vocab words in the Tokyo Vice dialog, which was exciting! I can't help but notice that people don't say &quot;thank you&quot; very much in that show, lol. We are hoping to do a trip to Japan this summer, which I am very excited to start planning for in earnest!</p>\n<p>Putting time into this blog this weekend was such a nice escape from all that work stress. Especially because the nastiest email came in at around 4:45. It always feels so bad when you put a ton of work in all week, but there's always that one thing that you didn't get to. It just wasn't a priority for me this week, and I communicated that! Ugh, I'm ranting about work again!</p>\n<p>I feel like I should be thankful that work is always busy for me around this time of year, because the reason makes me feel a little proud. It's Earth Month! We joke on my team that every day is Earth Day for us because we manage a lot of climate adaptation projects at my workplace. Between organizing activities, giving talks, and keeping up with my daily work, it just turns into a bit of a flurry.</p>\n<p>I am so excited about this blog though! It's only two days old and already feels like home.</p>\n<h2 id=\"reading-the-garden-of-seven-twilights-by-miguel-de-palol\" tabindex=\"-1\">Reading: The Garden of Seven Twilights by Miguel de Palol <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/april-so-far24/\">#</a></h2>\n<p>The Garden of Seven Twilights is such a cool book! I actually started it over this week because I got sidetracked and forgot what was happening. I picked it up in a bookstore in Ann Arbor when we visited for Thanksgiving last year. I was just drawn to the thickness of it and the semi-post-apocalyptic setting. I'll be sure to update as I get further in!</p>\n<h2 id=\"listening-the-new-beyonce-duh\" tabindex=\"-1\">Listening: The New Beyonce, duh! <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/april-so-far24/\">#</a></h2>\n<p>I am loving Cowboy Carter! My favorite song is bodyguard!</p>\n<h2 id=\"goals-for-this-week\" tabindex=\"-1\">Goals for this week <a class=\"header-anchor\" href=\"https://mayasdaydreams.com/blog/april-so-far24/\">#</a></h2>\n<ul>\n<li>Soak up that eclipse energy</li>\n<li>Spend less money</li>\n<li>Learn the numbers in Japanese</li>\n<li>Have a better week at work</li>\n<li>Do a new moon wishing ritual, and continue to follow the lunar cycle</li>\n</ul>\n",
			"date_published": "2024-04-07T00:00:00Z"
		}
		
	]
}
